{
    "data": {
    "_type": "news",
    "didUMean": "",
    "totalCount": 898,
    "relatedSearch": [],
    "value": [
        {
            "id": "8510603444151870532",
            "title": "How to Get Water Out of Your iPhone Using Siri",
            "url": "https://www.popsugar.com/tech/how-to-get-water-out-your-iphone-using-siri-48294475",
            "description": "If you accidentally get your iPhone wet, there's a shortcut you can do that taps Siri to expel the water from your phone using sound. How cool is that?!",
            "body": "#iphonetricks\n original sound - aakaanksh\nIs it just me being clumsy, or is it nearly impossible to keep your iPhonedry all the time? No matter how hard I try, my phone inevitably falls in water at some point. If this has happened to you, too, you probably know the drill: run to the kitchen, pour rice in a bag, stick your phone inside, and desperately hope you're not out hundreds of dollars for a new phone And if you're as unlucky as I am, rice then gets stuck in the charging port of your phone, and you begin to wonder if you can ever catch a break.\nBut thanks to TikTok user @kaansanity I now know a lifesaving hack that's much easier. Through this hack, you can eject the water from your speakers by simply asking Siri (!), who will play a sound that pushes out the water. I don't know about you, but I don't think iPhone hackscan get much cooler and more unexpected than that!\n:\nMake sure you have the \"Shortcuts\" app downloaded on your iPhone.\nGo to this Water Eject website which is the first link that pops up when you Google \"water shortcut.\"\nClick \"Get Shortcut.\"\nThe next time your phone gets wet, hold the power button to access Siri.\nSay \"Hey Siri, water eject shortcut.\" Siri will play a sound that shakes the water out of your speakers.\nI have just a couple of notes about this iPhone hack. First, while the water will eject out of your speakers, it may not eject out of the charging port. Second, when I tried to download this shortcut from the website, my phone wouldn't open it. A notification popped up saying the shortcut couldn't be opened because my security settings don't allow untrusted shortcuts. If the latter happens to you, you may want to change your settings or just play it safe by sticking with a bag and a drying agent at home, like a silica packet Either way, good luck!",
            "snippet": "If you accidentally get your iPhone wet, there's a shortcut you can do that taps Siri to expel the water from your phone using sound. How cool is that?!. #iphonetricks.  original sound - aakaanksh.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T20:15:03",
            "provider": {
                "name": "popsugar",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://media1.popsugar-assets.com/files/thumbor/3zi3AKGDc_fYRIJLmXslVXOil18/0x804:1456x1568/fit-in/1200x630/filters:format_auto-!!-:strip_icc-!!-/2021/04/28/730/n/47510821/1fdb18c960898e02039da3.13259978_.jpg",
                "height": 630,
                "width": 1200,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=547446232107586663",
                "thumbnailHeight": 236,
                "thumbnailWidth": 449,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "popsugar",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.popsugar.com/tech/how-to-get-water-out-your-iphone-using-siri-48294475"
            }
        },
        {
            "id": "9071056178787645349",
            "title": "Tech Stocks' May 6 Earnings Roster: SYNA, MCHP, DBX & More",
            "url": "https://www.zacks.com/stock/news/1504371/tech-stocks-may-6-earnings-roster-syna-mchp-dbx-more",
            "description": "Here is a sneak peek at how five notable technology stocks, SYNA, MCHP, DBX, HIMX, and DDOG, are expected to fare in their quarterly results slated to release on May 6.",
            "body": "Free Report\n)     Amazon Web Services revenuessurged 32% year over year to $13.5 billion. Meanwhile, Microsoft Azure revenuesimproved 46% at constant currency, driven by robust growth in consumption-based business.\nFurther, a rebound in the automotive space, accelerated deployment of 5G and strong PC marketworldwide might have favored the technology sector in the quarter under review.\nMoreover, encouraging PC shipments highlight the need for advanced processors in sleek enterprise laptops, which is expected to have contributed to the performance of semiconductor companies in the first quarter.\nIt must be noted that according to data from the Semiconductor Industry Association (SIA) worldwide sales of semiconductors hit $123.1 billion during first-quarter 2021, up 3.6% sequentially and 17.8% on a year-over-year basis.\nIn the words of John Neuffer, SIA president and CEO, as stated on Mar 1 Global semiconductor production is on the rise to meet increasing demand and ease the ongoing chip shortage affecting the auto sector and others, and annual sales are projected to increase in 2021.\nAlso, the rapid adoption of AI, Machine Learning (ML), cloud products and service, analytics, IoT, AR/VR, which are bolstering the adoption of cutting-edge semiconductors, might have significantly benefited the tech companies in the quarter to be reported.\nOther Key Factors to Note\nSolid uptick in video conferencing as a result of the current work-from-home trend is expected to have acted as a tailwind. Likewise, strengthening user penetration for online payment services is anticipated to have been encouraging for tech companies offering digital payment solutions.\nIncidentally, rise in use of Internet-based services has resulted in strong demand for cloud security solutions, which favored Akamais first-quarter performanceto a great extent.\nBesides, growing clout of streaming services for entertainment, rising user penetration on social media platforms and online gaming craze are expected to have been other positives. Markedly, Facebooks first-quarter 2021 top-line growthgained from increasing Average Revenue per User (ARPU), and growth in Monthly active users (MAUs) and Daily Active Users (DAUs).\nNevertheless, a slowdown in IT spending, and weakness across small and medium-sized businesses, due to disruptions caused by COVID-19, are likely to have weighed on the tech companies performance in the first quarter.\nAlso, a few companies arent witnessing as much growth due to normalizing demand for digital solutions.\nThis can be ascertained from ServiceNows first-quarter 2021 results Although ServiceNow has been benefiting from rising adoption of its workflows by enterprises undergoing digital transformation, slowing down of growth in new customer acquisition remains a concern. The company concluded first-quarter with 1,146 total customers having more than $1 million in ACV, up 23% year over year and up 53 sequentially. However, in December quarter, the customers increased by 82 on a sequential basis to 1,093.\nSneak Peek on Upcoming Releases\nGiven this interesting mix of factors, lets see how the following technology stocks are poised ahead of their quarterly results slated to be reported on May 6.\nOur quantitative model predicts an earnings beat for the company with a positive Earnings ESPand a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) as this combination increases the odds of a positive surprise.\nSynaptics Incorporated (",
            "snippet": "Also, the rapid adoption of AI, Machine Learning (ML), cloud products and service, analytics, IoT, AR/VR, which are bolstering the adoption of cutting-edge semiconductors, might have significantly benefited the <b>tech</b> companies in the quarter to be reported..",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T20:00:37",
            "provider": {
                "name": "zacks",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://staticx-tuner.zacks.com/images/articles/main/7f/211.jpg",
                "height": 400,
                "width": 635,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3507090237658097512",
                "thumbnailHeight": 149,
                "thumbnailWidth": 237,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "zacks",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.zacks.com/stock/news/1504371/tech-stocks-may-6-earnings-roster-syna-mchp-dbx-more"
            }
        },
        {
            "id": "7367254441168740077",
            "title": "Red Tail One",
            "url": "http://www.dvidshub.net/video/793589/red-tail-one",
            "description": "Col. Doug DeMaio took command of the 187th Fighter Wing May 5th, 2021. The new Red Tail One addressed his airmen and community leaders in a ceremony at Dannelly Field, Alabama. (U.S. Air Force video by Tech. Sgt. William Blankenship)",
            "body": "Add the following CSS to the header block of your HTML document.\nThen add the mark-up below to the body block of the same document.\n.videoWrapper {    position: relative;    padding-bottom: 56.25%;    padding-top: 25px;    height: 0;}.videoWrapper iframe {    position: absolute;    top: 0;    left: 0;    width: 100%;    height: 100%;}\n\nshow more",
            "snippet": "Col. Doug DeMaio took command of the 187th Fighter Wing May 5th, 2021. The new Red Tail One addressed his airmen and community leaders in a ceremony at Dannelly Field, Alabama. (U.S.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T19:55:37",
            "provider": {
                "name": "dvidshub",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://cdn.dvidshub.net/media/thumbs/frames/video/2105/793589/1000w_q75.jpg",
                "height": 563,
                "width": 1000,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3035569001821228591",
                "thumbnailHeight": 281,
                "thumbnailWidth": 499,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "dvidshub",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "http://www.dvidshub.net/video/793589/red-tail-one"
            }
        },
        {
            "id": "8895764929659723423",
            "title": "How to Do the TikTok iPhone Photo-Editing Hack",
            "url": "https://www.popsugar.com/tech/tiktok-iphone-photo-editing-hack-48305898",
            "description": "TikTok's photo-editing hack requires no more than an iPhone and a camera-roll selfie no editing apps are needed!",
            "body": "TikTok users are quite the trendsetters\n, so it's no surprise they've come up with a photo-editing techniquethat turns ordinary camera-roll selfies into a vibey, sun-kissed dream. Perfect for summer, all that this golden-hour hack requires are an iPhone and a selfie of your choice. From there, you'll jump into a world of adjusting vibrance, hues, saturation, and more that'll take your picture through a journey of twists and turns  but trust the process! Once it's all done, it'll easily become one of your best-edited selfies to date. TikTok user\n's video of the hack has a whopping 13 million views so far and has inspired a slew of other users to give it a try for themselves. Psst . . . the results are good every. single. time.\ni tried the new tik tok iphone editing hack  no edits  edits",
            "snippet": "TikTok's photo-editing hack requires no more than an iPhone and a camera-roll selfie no editing apps are needed!. TikTok users are quite the trendsetters. , so it's no surprise they've come up with a photo-editing techniquethat turns ordinary camera-roll selfies into a vibey, sun-kissed dream. Perfect for summer, all that this golden-hour hack requires are an iPhone and a selfie of your choice.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T19:40:00",
            "provider": {
                "name": "popsugar",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://media1.popsugar-assets.com/files/thumbor/vdzlIztffqL7dCh4RHrKnwiYb6U/fit-in/1200x630/filters:format_auto-!!-:strip_icc-!!-:fill-!white!-/2021/05/05/730/n/1922507/99e30ee36092c8853b7304.10665109_.png",
                "height": 630,
                "width": 1200,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=1493084455663487227",
                "thumbnailHeight": 176,
                "thumbnailWidth": 337,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "popsugar",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.popsugar.com/tech/tiktok-iphone-photo-editing-hack-48305898"
            }
        },
        {
            "id": "8697318374249588869",
            "title": "Salesforce CEO Marc Benioff announces when employees can return to in-person work",
            "url": "https://www.sfgate.com/tech/article/2021-05-Salesforce-return-office-CEO-Marc-Benioff-16154043.php",
            "description": "It may signal a shifting of the tides for San Francisco tech workers.",
            "body": "People are seen inside the Salesforce Tower on Dec. 1, 2020, in San Francisco.\nStephen Lam/Getty Images\nSalesforce CEO Marc Benioff announced the official date for when employees can return to the Tower a shifting of the tides for San Francisco tech workers, who have largely pivoted to remote work during the coronavirus pandemic.\nIn a tweet celebrating San Franciscos transition to the yellow tier and a low caseload, he said that employees  internally referred to as the ohana, the Hawaiian term for family  are able to return to the office beginning May 17.\nIt is unclear if this signals an end to remote work for Salesforce. The company announced that nearly two-thirds of its staff will likely work remote indefinitely as part of an initiative rolled out in February\nGorgeous day @SalesforceTower Looking forward to welcoming back the Ohana on May 17th! San Francisco now at the lowest tier. Only 17 cases in San Francisco today. ",
            "snippet": "It may signal a shifting of the tides for San Francisco <b>tech</b> workers.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T19:11:05",
            "provider": {
                "name": "sfgate",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://s.hdnux.com/photos/01/16/43/25/20591954/3/rawImage.jpg",
                "height": 1365,
                "width": 2048,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=8800925137950669901",
                "thumbnailHeight": 170,
                "thumbnailWidth": 255,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "sfgate",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.sfgate.com/tech/article/2021-05-Salesforce-return-office-CEO-Marc-Benioff-16154043.php"
            }
        },
        {
            "id": "3377555843300976570",
            "title": "Applied Materials widens Sunnyvale holdings with new purchase  Silicon Valley",
            "url": "https://www.siliconvalley.com/2021/05/05/applied-materials-widens-sunnyvale-holdings-tech-develop-real-estate/",
            "description": "Applied Materials has just bought a research and office building in Sunnyvale, part of the tech titans widening shopping spree for buildings in Sunnyvale.",
            "body": "RSS\nSUNNYVALE  Applied Materials has bought a Sunnyvale research building, an indication that the tech titan has yet to quench its thirst for Silicon Valley buildings that it some someday could redevelop as modern offices.\nIn recent years, Applied Materials has launched a shopping spree for buildings occupying Sunnyvale sites that are suitable for transformation into new office buildings.\nSanta Clara-based Applied Materials has spent at least $147.9 million in recent years, including this weeks property purchase, to buy an array of sites in Sunnyvale.\nIn the most recent deal, Applied Materials paid $34.3 million for a low-slung office building in Sunnyvale, according to documents filed in Santa Clara County on May 4.\nLocated at 995 E. Arques Ave., the Sunnyvale building totals 79,800 square feet, LoopNet listing services show.\nUntil the most recent deal, most of the Applied Materials purchases had occurred in a roughly rectangular area of Sunnyvale thats bounded by East Arques Avenue, Lawrence Expressway, Central Expressway, and Wolfe Road.\nSanta Clara-based Applied Materials already is the owner of a big complex in this rectangle at 974 E. Arques Ave. thats known as Applied Materials Building 81.\nThe latest acquisition by Applied Materials is just across the street from this rectangle.\nApplied Materials, a supplier of equipment and materials used to produce semiconductors, has not commented on its property purchasing efforts.\n",
            "snippet": "Applied Materials has just bought a research and office building in Sunnyvale, part of the <b>tech</b> titans widening shopping spree for buildings in Sunnyvale.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T19:09:01",
            "provider": {
                "name": "siliconvalley",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://www.siliconvalley.com/wp-content/uploads/2021/05/SJM-L-APPLIEDMATERIALS-x-01-1.jpg",
                "height": 747,
                "width": 1488,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=2077291096610608213",
                "thumbnailHeight": 69,
                "thumbnailWidth": 137,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "siliconvalley",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.siliconvalley.com/2021/05/05/applied-materials-widens-sunnyvale-holdings-tech-develop-real-estate/"
            }
        },
        {
            "id": "8175730000635789525",
            "title": "NCAA Sterling Silver Virginia Tech Medium Pendant",
            "url": "https://shop.mashable.com/sales/ncaa-sterling-silver-virginia-tech-medium-pendant-2?aid=&utm_campaign=feed&utm_medium=RSS&utm_source=mashable",
            "description": "Mashable Shop is the leading destination for stylish accessories, gadgets, everyday carry essentials & more. Discover one-of-a-kind products at amazing prices.",
            "body": "Stay up-to-date on exclusive new deals!\nShips from vendor within 2 days\nDescription\nIf you are a fan of Virginia Tech and the Hokies then you need to show your school spirit with this Virginia Tech pendant. We are a certified retailer and this authentic item is officially licensed. It is crafted from Sterling Silver and crafted by LogoArt in the USA.\nAuthentic and Made in the USACrafted from Sterling SilverPerfect for every Hokies fanOfficially licensed for Virginia Tech\nShipping\nExpected Delivery: May 12 - May 16\nTerms\nReturns accepted within 30 days of shipment for orders within the Contiguous US.\nGive $10, Get $10\nSign up & get 10% Off\nEmail address\nSign up\n*New customers only. Offer lasts 30 days. See Terms.        This site is protected by reCAPTCHA and the Google        Privacy Policyand        Terms of Serviceapply.\nMy Account",
            "snippet": "If you are a fan of Virginia <b>Tech</b> and the Hokies then you need to show your school spirit with this Virginia <b>Tech</b> pendant.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T18:49:45",
            "provider": {
                "name": "mashable",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://cdnp2.stackassets.com/3dda13e01ab761f8f576071e6b5c368cf12604bc/store/5489fe5c9cc74d58a94c2be00c8412db33d1ce0b6ac00743c318b868aa50/image_processing20210430-69-1gxhhuf.jpg",
                "height": 473,
                "width": 630,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=7214847756048818898",
                "thumbnailHeight": 236,
                "thumbnailWidth": 314,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "mashable",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://shop.mashable.com/sales/ncaa-sterling-silver-virginia-tech-medium-pendant-2?aid=&utm_campaign=feed&utm_medium=RSS&utm_source=mashable"
            }
        },
        {
            "id": "6638458837929772850",
            "title": "I feel happy and blessed that I am doing such a wonderful show: NidhiShahon 'Anupamaa'",
            "url": "https://themiracletech.com/latest/i-feel-happy-and-blessed-that-i-am-doing-such-a-wonderful-show-nidhi-shah-on-anupamaa/",
            "description": "The second wave of COVID has affected the country much worse than the first one. The lack of oxygen cylinders, surge in cases, and the increasing number of deaths, is taking a toll on everyone. Though taking precautions is the best way to fight this battle, it is also important to keep a positive mindset []",
            "body": "ENTERTAINMENT\nI feel happy and blessed that I am doing such a wonderful show: Nidhi Shah on Anupamaa\nThe second wave of COVID has affected the country much worse than the first one. The lack of oxygen cylinders, surge in cases, and the increasing number of deaths, is taking a toll on everyone. Though taking precautions is the best way to fight this battle, it is also important to keep a positive mindset too. Anupamaa actress Nidhi Shah, who recently recovered from COVID, shared that she has stopped watching news.\nI was keeping myself occupied by just talking to my close ones daily on video call. I watched all the happy and funny shows on Netflix and listened to songs and dance on it, so this what I am doing right now. I feel blessed that I was staying with my family and chilling with them. I am just trying to avoid news, and I know its not good outside with all that is happening but I just tend to avoid it and focus on the good, she said.\nNidhi recently joined the cast of her show and has shot for a couple of scenes on her phone. When asked about the precautions she is going to take now, she said, I am going to take extra precautions. I am going to be more careful health-wise because post-COVID your body falls weak and you tend to feel sleepy, so right now I am just hoping to get back to work soon and take extra care, sleep on time, eat proper food, wear my mask as much as I can and try to motivate people.\nThe young actress is all praise for her producer Rajan Shahi and said he used to personally call to check on her health. He is the best producer I have ever worked with. He is doing his level best and giving more than 100 percent to his team because it takes an effort to take care of the entire unit of not just one show but four shows, she said.\nHe is taking care of everybody and has always been there for all of us through thick and thin, even if we felt sick. He is trying to give the best to the audience and entertain them. I feel happy and blessed that I am doing such a wonderful show, and its all because of Rajan shahi. I thank him every day, Nidhi concluded.\nRelated Items:",
            "snippet": "The second wave of COVID has affected the country much worse than the first one. The lack of oxygen cylinders, surge in cases, and the increasing number of deaths, is taking a toll on everyone. Though taking precautions is the best way to fight this battle, it is also important to keep a positive mindset []. ENTERTAINMENT.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T18:39:51",
            "provider": {
                "name": "themiracletech",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://themiracletech.com/wp-content/uploads/2021/05/1620239992_I-feel-happy-and-blessed-that-I-am-doing-such-1000x600.jpeg",
                "height": 600,
                "width": 1000,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=8377163865162237223",
                "thumbnailHeight": 150,
                "thumbnailWidth": 250,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "themiracletech",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://themiracletech.com/latest/i-feel-happy-and-blessed-that-i-am-doing-such-a-wonderful-show-nidhi-shah-on-anupamaa/"
            }
        },
        {
            "id": "1481908744323859553",
            "title": "NCAA Sterling Silver Texas Tech U. Large I Love Logo Pendant",
            "url": "https://shop.mashable.com/sales/ncaa-sterling-silver-texas-tech-u-large-i-love-logo-pendant?aid=&utm_campaign=feed&utm_medium=RSS&utm_source=mashable",
            "description": "Mashable Shop is the leading destination for stylish accessories, gadgets, everyday carry essentials & more. Discover one-of-a-kind products at amazing prices.",
            "body": "Stay up-to-date on exclusive new deals!\nShips from vendor within 2 days\nDescription\nIf you are a fan of Texas Tech University and the Red Raiders then you need to show your school spirit with this Texas Tech University pendant. We are a certified retailer and this authentic item is officially licensed. It is crafted from Sterling Silver and crafted by LogoArt in the USA.\nAuthentic and Made in the USACrafted from Sterling SilverPerfect for every Red Raiders fanOfficially licensed for Texas Tech University\nShipping\nExpected Delivery: May 12 - May 16\nTerms\nReturns accepted within 30 days of shipment for orders within the Contiguous US.\nGive $10, Get $10\nSign up & get 10% Off\nEmail address\nSign up\n*New customers only. Offer lasts 30 days. See Terms.        This site is protected by reCAPTCHA and the Google        Privacy Policyand        Terms of Serviceapply.\nMy Account",
            "snippet": "Authentic and Made in the USACrafted from Sterling SilverPerfect for every Red Raiders fanOfficially licensed for Texas <b>Tech</b> University.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T18:35:25",
            "provider": {
                "name": "mashable",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://cdnp0.stackassets.com/0961f29fdf3b5724a7f102dd7b0a78bd2b4edd78/store/5f07f0a0e2e3b3abb33ce29a241b2547dea9a55076857aee7c5c52220994/image_processing20210430-69-199lvy9.jpg",
                "height": 473,
                "width": 630,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=2174742813169273073",
                "thumbnailHeight": 177,
                "thumbnailWidth": 235,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "mashable",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://shop.mashable.com/sales/ncaa-sterling-silver-texas-tech-u-large-i-love-logo-pendant?aid=&utm_campaign=feed&utm_medium=RSS&utm_source=mashable"
            }
        },
        {
            "id": "6090988921130933923",
            "title": "Tech Pioneers Featured Prominently in CFB HOF Exhibit  Georgia Tech Official Athletic Site",
            "url": "https://themiracletech.com/latest/tech-pioneers-featured-prominently-in-cfb-hof-exhibit-georgia-tech-official-athletic-site/",
            "description": "THE FLATS  Georgia Tech footballs first African-American student-athletes are recognized as part of the new Blood, Sweat and Tears exhibit at Atlantas College Football Hall of Fame. Blood, Sweat and Tears tells the story of the integration of college football. The exhibit includes a tribute to the groundbreaking African-Americans that integrated Techs football program []",
            "body": "LATEST\nTech Pioneers Featured Prominently in CFB HOF Exhibit  Georgia Tech Official Athletic Site\nTHE FLATS  Georgia Tech footballs first African-American student-athletes are recognized as part of the new Blood, Sweat and Tears exhibit at Atlantas College Football Hall of Fame. Blood, Sweat and Tears tells the story of the integration of college football.\nThe exhibit includes a tribute to the groundbreaking African-Americans that integrated Techs football program in the late 1960s and early 1970s, a group that includes Eddie McAshan, Karl Barnes, Greg Horne and Joe Harris. Harris was integral to efforts to have the Yellow Jackets pioneers recognized in the exhibit.\nJoe Harris stands alongside his Georgia Tech jersey in the Blood, Sweat and Tears exhibit at the College Football Hall of Fame.\nGeorgia Tech celebrated the legacy of the first African-American student-athletes in Tech football history in 2018. Click\nHERE\nfor a full recap of the weekend-long celebration, which was held in conjunction with the Yellow Jackets home win over Bowling Green.\nThe Blood, Sweat and Tears exhibit is included in the cost of admission to the College Football Hall of Fame which is located in downtown Atlanta, less than a mile from Georgia Techs campus. The College Football Hall of Fame is open from 10 a.m.-5 p.m., Thursday-Sunday.\nHARRIS PRODUCES MOVIE\nIn addition to his efforts to have Georgia Tech included in the Blood, Sweat and Tears exhibit at the College Football Hall of Fame, former Georgia Tech football star Joe Harris has also been busy in show business, as he is a producer in the recently released movie My Brothers Keeper. The movie, which stars T.C. Stallings, Keshia Knight Pulliam and Joey Lawrence, was filmed in Columbus, Ga. and released in March to more than 250 theaters nationwide. It was Harris first foray into movie production.\nFor more on My Brothers Keeper, visit\n.\n2021 GEORGIA TECH FOOTBALL SEASON TICKETS\n2021 Georgia Tech football season are on sale now. Starting at just $299 per seat, season tickets include reserved seats for all seven games on the Yellow Jackets 2021 home schedule, including Mayhem at MBS versus North Carolina on Sept. 25 at Mercedes-Benz Stadium and the return of Clean, Old-Fashioned Hate versus archrival Georgia on Nov. 27 at Bobby Dodd Stadium. For full 2021 Georgia Tech football season ticket information, visit ramblinwreck.com/footballtickets\nSingle-game tickets will go on this summer. Click HEREto receive information and presale opportunities when they become available.\nAlexander-Tharpe Fund\nThe Alexander-Tharpe Fund is the fundraising arm of Georgia Tech athletics, providing scholarship, operations and facilities support for Georgia Techs 400-plus student-athletes. Be a part of developing Georgia Techs Everyday Champions and helping the Yellow Jackets compete for championships at the highest levels of college athletics by supporting the",
            "snippet": "THE FLATS  Georgia <b>Tech</b> footballs first African-American student-athletes are recognized as part of the new Blood, Sweat and Tears exhibit at Atlantas College Football Hall of Fame.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T18:31:22",
            "provider": {
                "name": "themiracletech",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://themiracletech.com/wp-content/uploads/2021/05/tech-pioneers-featured-prominently-in-cfb-hof-exhibit-georgia-tech-official-athletic-site-1000x600.jpg",
                "height": 600,
                "width": 1000,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=1459932985596444127",
                "thumbnailHeight": 168,
                "thumbnailWidth": 280,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "themiracletech",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://themiracletech.com/latest/tech-pioneers-featured-prominently-in-cfb-hof-exhibit-georgia-tech-official-athletic-site/"
            }
        },
        {
            "id": "8510603444151870532",
            "title": "How to Get Water Out of Your iPhone Using Siri",
            "url": "https://www.popsugar.com/tech/how-to-get-water-out-your-iphone-using-siri-48294475",
            "description": "If you accidentally get your iPhone wet, there's a shortcut you can do that taps Siri to expel the water from your phone using sound. How cool is that?!",
            "body": "#iphonetricks\n original sound - aakaanksh\nIs it just me being clumsy, or is it nearly impossible to keep your iPhonedry all the time? No matter how hard I try, my phone inevitably falls in water at some point. If this has happened to you, too, you probably know the drill: run to the kitchen, pour rice in a bag, stick your phone inside, and desperately hope you're not out hundreds of dollars for a new phone And if you're as unlucky as I am, rice then gets stuck in the charging port of your phone, and you begin to wonder if you can ever catch a break.\nBut thanks to TikTok user @kaansanity I now know a lifesaving hack that's much easier. Through this hack, you can eject the water from your speakers by simply asking Siri (!), who will play a sound that pushes out the water. I don't know about you, but I don't think iPhone hackscan get much cooler and more unexpected than that!\n:\nMake sure you have the \"Shortcuts\" app downloaded on your iPhone.\nGo to this Water Eject website which is the first link that pops up when you Google \"water shortcut.\"\nClick \"Get Shortcut.\"\nThe next time your phone gets wet, hold the power button to access Siri.\nSay \"Hey Siri, water eject shortcut.\" Siri will play a sound that shakes the water out of your speakers.\nI have just a couple of notes about this iPhone hack. First, while the water will eject out of your speakers, it may not eject out of the charging port. Second, when I tried to download this shortcut from the website, my phone wouldn't open it. A notification popped up saying the shortcut couldn't be opened because my security settings don't allow untrusted shortcuts. If the latter happens to you, you may want to change your settings or just play it safe by sticking with a bag and a drying agent at home, like a silica packet Either way, good luck!",
            "snippet": "If you accidentally get your iPhone wet, there's a shortcut you can do that taps Siri to expel the water from your phone using sound. How cool is that?!. #iphonetricks.  original sound - aakaanksh.",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T20:15:03",
            "provider": {
                "name": "popsugar",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://media1.popsugar-assets.com/files/thumbor/3zi3AKGDc_fYRIJLmXslVXOil18/0x804:1456x1568/fit-in/1200x630/filters:format_auto-!!-:strip_icc-!!-/2021/04/28/730/n/47510821/1fdb18c960898e02039da3.13259978_.jpg",
                "height": 630,
                "width": 1200,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=547446232107586663",
                "thumbnailHeight": 236,
                "thumbnailWidth": 449,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "popsugar",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.popsugar.com/tech/how-to-get-water-out-your-iphone-using-siri-48294475"
            }
        },
        {
            "id": "9071056178787645349",
            "title": "Tech Stocks' May 6 Earnings Roster: SYNA, MCHP, DBX & More",
            "url": "https://www.zacks.com/stock/news/1504371/tech-stocks-may-6-earnings-roster-syna-mchp-dbx-more",
            "description": "Here is a sneak peek at how five notable technology stocks, SYNA, MCHP, DBX, HIMX, and DDOG, are expected to fare in their quarterly results slated to release on May 6.",
            "body": "Free Report\n)     Amazon Web Services revenuessurged 32% year over year to $13.5 billion. Meanwhile, Microsoft Azure revenuesimproved 46% at constant currency, driven by robust growth in consumption-based business.\nFurther, a rebound in the automotive space, accelerated deployment of 5G and strong PC marketworldwide might have favored the technology sector in the quarter under review.\nMoreover, encouraging PC shipments highlight the need for advanced processors in sleek enterprise laptops, which is expected to have contributed to the performance of semiconductor companies in the first quarter.\nIt must be noted that according to data from the Semiconductor Industry Association (SIA) worldwide sales of semiconductors hit $123.1 billion during first-quarter 2021, up 3.6% sequentially and 17.8% on a year-over-year basis.\nIn the words of John Neuffer, SIA president and CEO, as stated on Mar 1 Global semiconductor production is on the rise to meet increasing demand and ease the ongoing chip shortage affecting the auto sector and others, and annual sales are projected to increase in 2021.\nAlso, the rapid adoption of AI, Machine Learning (ML), cloud products and service, analytics, IoT, AR/VR, which are bolstering the adoption of cutting-edge semiconductors, might have significantly benefited the tech companies in the quarter to be reported.\nOther Key Factors to Note\nSolid uptick in video conferencing as a result of the current work-from-home trend is expected to have acted as a tailwind. Likewise, strengthening user penetration for online payment services is anticipated to have been encouraging for tech companies offering digital payment solutions.\nIncidentally, rise in use of Internet-based services has resulted in strong demand for cloud security solutions, which favored Akamais first-quarter performanceto a great extent.\nBesides, growing clout of streaming services for entertainment, rising user penetration on social media platforms and online gaming craze are expected to have been other positives. Markedly, Facebooks first-quarter 2021 top-line growthgained from increasing Average Revenue per User (ARPU), and growth in Monthly active users (MAUs) and Daily Active Users (DAUs).\nNevertheless, a slowdown in IT spending, and weakness across small and medium-sized businesses, due to disruptions caused by COVID-19, are likely to have weighed on the tech companies performance in the first quarter.\nAlso, a few companies arent witnessing as much growth due to normalizing demand for digital solutions.\nThis can be ascertained from ServiceNows first-quarter 2021 results Although ServiceNow has been benefiting from rising adoption of its workflows by enterprises undergoing digital transformation, slowing down of growth in new customer acquisition remains a concern. The company concluded first-quarter with 1,146 total customers having more than $1 million in ACV, up 23% year over year and up 53 sequentially. However, in December quarter, the customers increased by 82 on a sequential basis to 1,093.\nSneak Peek on Upcoming Releases\nGiven this interesting mix of factors, lets see how the following technology stocks are poised ahead of their quarterly results slated to be reported on May 6.\nOur quantitative model predicts an earnings beat for the company with a positive Earnings ESPand a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) as this combination increases the odds of a positive surprise.\nSynaptics Incorporated (",
            "snippet": "Also, the rapid adoption of AI, Machine Learning (ML), cloud products and service, analytics, IoT, AR/VR, which are bolstering the adoption of cutting-edge semiconductors, might have significantly benefited the <b>tech</b> companies in the quarter to be reported..",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-05T20:00:37",
            "provider": {
                "name": "zacks",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "https://staticx-tuner.zacks.com/images/articles/main/7f/211.jpg",
                "height": 400,
                "width": 635,
                "thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3507090237658097512",
                "thumbnailHeight": 149,
                "thumbnailWidth": 237,
                "base64Encoding": null,
                "name": null,
                "title": null,
                "provider": {
                    "name": "zacks",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.zacks.com/stock/news/1504371/tech-stocks-may-6-earnings-roster-syna-mchp-dbx-more"
            }
        }
    ]
    } 
}